{"context": "The problem of broadcasting on directed radio networks has received much attention. The protocol given by [1] requires O(n²)  rounds for completion. This upper bound was reduced to O(n^\\frac{3}{2})  rounds by a breakthrough result of [2]. In a further breakthrough, [3], the authors deployed the probabilistic method to bring the upper bound from O(n łg ²₂ n)  to within logarithmic factors of the best known lower bound Ω (n łg ₂ D) . In [4], a further improvement has been made for small diameter networks. They establish an upper bound of O(n łg ₂ n łg ₂ D) . In [5], the authors define and deploy new combinatorial structures to reduce this gap between lower and upper bounds to O(łg ₂ D)  factor i.e., give a broadcasting protocol running in O(n łg ²₂ D)  rounds.\n", "citations": {"[1]": {"id": "https://openalex.org/W2015356474", "ref": "B.S. Chlebus, L. Gasieniec, A. Gibbons, A. Pelc and W. Rytter. Deterministic broadcasting in unknown radio networks, In Proceedings of 11th Annual ACM-SIAM Symposium on Discrete Algorithms, SODA'99 861-870."}, "[2]": {"id": "https://openalex.org/W2167242526", "ref": "B.S. Chlebus, L. Gasieniec, A. Gibbons, A. Ostlin and J.M. Robson. Deterministic radio broadcasting. In Proceedings 27th International Colloquium on Automata, Languages and Programming, ICALP'2000,LNCS 1853, 717-728."}, "[3]": {"id": "https://openalex.org/W2134516390", "ref": "M. Chrobak, L. Gasieniec and W. Rytter. Fast broadcasting and gossiping in radio networks, In Proceedings 41st Annual IEEE Symposium on Foundations of Computer Science, FOCS'2000, 575-581."}, "[4]": {"id": "https://openalex.org/W2153529758", "ref": "Dariusz R. Kowalski and Andrzej Pelc, Deterministic Broadcasting Time in Radio Networks of Unknown Topology, In Proceedings 43rd Symposium on Foundations of Computer Science, FOCS'2002."}, "[5]": {"id": "https://openalex.org/W2099198672", "ref": "A. Czumaj and W. Rytter. Broadcasting Algorithms in Radio Networks with Unknown Topology, To appear in Proceedings of the 44th Annual IEEE Symposium on Foundations of Computer Science, FOCS 2003, Cambridge, MA."}}}