{"year": 2008, "cat": "cs.CV", "smpls": [{"orig_sec": "Introduction", "label": "i", "text": "Finding areas of text in a natural image is a difficult problem.\nOne reason for this is that, from a texture and geometric standpoint,\nmany objects (e.g., tree branches or electrical wire on a blue sky) resemble text.\nIn addition, the text size, font, color, orientation and skew are generally unpredictable.\nIn the following, we introduce an efficient method for finding text areas in natural images.\nThe only assumption we make regarding the text is that it is written\non a more or less uniform background\nusing a contrasting color.\nIn particular, the text could be written in cursive letters or with foreign characters and even contain simple graphics.\nWe proceed by using a combination of texture and shape features\nin order to sequentially rule out regions of the image which do not contain text.\nOne of key elements of our approach\nis that we begin by focusing on finding the text background, rather than the text itself.\nFinding backgrounds is a lot simpler than finding text directly.\nIt can be accomplished robustly by extracting some well chosen texture features.\nOnce a potential background area has been selected,\nwe then use a combination of shape and color features to detect whether text is present inside the area.\nHaving pre-identified the background provides us with a sample of the background color and texture,\nand thus simplifies the problem of determining whether there is text on the background.\nThe search for the text area is performed hierarchically in a top-down fashion:\nif no text is found at a given scale, then we look for text at a smaller scale.\nThis allows us to find the text without making prior assumptions regarding the font and area sizes.\n"}, {"orig_sec": "Introduction", "label": "i", "text": "There is an extensive literature on the problem of segmenting text areas in images.\nMany methods are specifically designed to deal with special types of images, such as documents [1], webpages [2], or pictures of newspaper [3].\nFor each type of documents, assumptions are made regarding the type of text present in the image and its surrounding.\nFor example, for newspapers it can be assumed that the text is written in black on a white background,\nfor text written using the roman alphabet it can be assumed that the characters are written at regular intervals, etc.\nOne problem that resembles the problem of finding text in natural area is that of segmenting license plates on natural images containing cars [4], [5],\non which a lot of effort has been put.\n"}, {"orig_sec": "Introduction", "label": "i", "text": "The general problem of finding text in natural images has also been considered [1], [2], [3].\nMany text area segmentation methods formulate the problem as a two-class decision problem:\nis the given block/pixel part of a text area or not? Then the problem is reduced to finding good features for formulating this decision problem\nand finding a good classifier for making decisions.\nIn general, three types of features are used for identifying the text: texture based, edge based or connected-component based.\nSometimes, three or more classes are considered (e.g., text, background, and other) in order to increase the accuracy of the classification.\nBut false positives always constitute a nuisance and the parameters of the classifier must be carefully tuned in order to avoid them as much as possible.\nIn contrast, we do not look text directly, but rather find the text by first finding likely text contexts\nand studying the features of each potential text context to decide whether or not it contains text.\nFalse positives in the early stages thus do not constitute a problem,\nand so we can conservatively estimate the thresholds of the early decision parameters.\nThe details of our approach are given in the next section.\nIn Section ,\nwe present our experimental methodology and results\nbefore concluding in Section .\n"}, {"orig_sec": "Experimental Results", "label": "r", "text": "We tested our method on a database of 65 (three megapixel) images of outdoor signs and shop displays.\nTen of these images contained outdoor signs written in both English and Urdu.\nThe rest (55 images) contained English signs only, but some included simple graphics as well.\nAll the text area was correctly segmented in 63 (i.e., 97%) of these 65 images.\nIn four of these 63 images, some other areas were also segmented as well.\nHowever, these areas all contain highly contrasting high level structures on a uniform background\nwhich in many ways resemble text (for example, a capital \"i\" letter) but could be ruled out from a semantic point of view.\n"}, {"orig_sec": "Conclusion", "label": "d", "text": "We have presented a top-down hierarchical methods for finding text areas in natural images.\nThe key point of this method is that it begins by looking for text background areas\nbefore testing for the presence of text inside the selected areas.\nThe method correctly segmented all the text in 97% of the images in a small database of outdoor signs and shop displays.\nIn future work, we will test the method on a larger database of natural images.\nTo improve the results, we will use training to choose the optimal parameters\nfor all the decisions we perform.\nWe will also investigate the use of more sophisticated text presence test\n(e.g., edge based or connected component based)\nin order to improve the quality of the last step of our method.\n"}]}