{"year": 2015, "cat": "cs.SI", "smpls": [{"orig_sec": "Introduction", "label": "i", "text": "Networked information technologies have changed the way people use and\nreuse creative – and frequently copyrighted – materials. This change\nhas generated excitement, and heated debate, among\ncontent-creators, technologists, legal academics, and media scholars.\nMedia theorist Lev Manovich argues that remixing is an ancient\ncultural tradition (e.g., he has suggested that ancient Rome was a\n“remix” of ancient Greece) but that information technologies have\naccelerated these processes and made remixing more salient\n[1]. Sinnreich et al. argue that\n“configurable culture” has been significantly transformed by\nnetworked technologies which introduce perfect copying and allow\npeople not only to be inspired by extant creations but to remix the\noriginal works themselves [2]. Legal scholars\nhave stressed the importance of remixing in cultural creation broadly\nand warned that current copyright and intellectual property laws may\nhinder creativity and innovation\n[3], [4].\n"}, {"orig_sec": "Introduction", "label": "i", "text": "Several of the most influential scholarly explorations of\nremixing as a cultural phenomenon have focused on youth's remixing practices.\nFor example, work on remixing by Jenkins [1]\nand Ito [2] has focused on young people's use and\nre-use of media. Palfrey and Gasser have suggested that the cultural practices of “digital native”\nyouth have had a significant transformative effect on our culture [3].\nThroughout his book “Remix,” Lessig uses youth's reuse practices to support an\nargument against what he considers excessive copyright legal\nprotection [4].\n<FIGURE>"}, {"orig_sec": "Introduction", "label": "i", "text": "Yet, despite a wide interest in remixing and authorship, researchers\nhave only recently engaged in empirical research on the subject\n[10]. Several recent treatments have\npresented studies of video remixing communities\n[8], [3], music remixing\ncommunities [10], collaborative video\ngame communities [5] and social network sites [6].\nThere is also another quantitative study of our empirical setting [7]\nfocused on characterizing the variety of responses to remixing.\nThese studies have tended to be general and\nlargely descriptive examinations of remixing practice. This work\nhas pointed to the existence of norms\n[8] and the territoriality of digital\ncreators [9] and has considered issues of\nmotivation [10]. However, empirical work has yet to\nunpack in detail the key social mechanisms that scholars have\nsuggested drive behavior, norms, and motivation in remixing\ncommunities.\n"}, {"orig_sec": "Introduction", "label": "i", "text": "Perhaps no mechanism has been more frequently cited as critical for\nremixing activity than attribution and the related\nphenomena of plagiarism, reputation, and status. For example, recent\nsurvey-based work has suggested that the “authenticity and legitimacy” of creative work\n“are premised on the explicit acknowledgment of the source materials or\n`original creator”' and that such acknowledgment is a key component of how adults assess\nthe fairness or ethical nature of content reuse\n[1]. Attribution, in this sense, can be seen\nas an important way that people distinguish remixing from “theft.”\n"}, {"orig_sec": "Introduction", "label": "i", "text": "Judge and law professor Richard Posner stresses the importance of\nattribution and explains that this is important even when there is no\nmonetary benefit to being attributed. For example, he explains that\nEuropean copyright law is based on a doctrine of “moral rights”\nthat “entitles a writer or other artist to be credited for his\noriginal work and this `attribution right', as it is called, would\ngive him a legal claim against a plagiarist.” Posner also explains\nthat “acknowledgment” of another's contributions to a derivative\nnegates any charge of plagiarism, although it may not establish\noriginality [1]. Attribution plays such an\nimportant role in remix culture that Creative Commons made a\nrequirement for attribution a component of all their licenses after\nmore than 97% of licensors opted to require attribution when it was\noffered as a choice [2].\n"}, {"orig_sec": "Introduction", "label": "i", "text": "Young people's perceptions of attribution and complications around\ncopying have also been examined. An article by Friedman describes\nthat adolescents who allowed “computer pirating” – the unauthorized\ncopying of computer programs – did so because technological affordances\nmade it difficult for adolescents to identify “harmful\nor unjust consequences of computer-mediated actions”\n[1]. In a second study, psychologists Olson\nand Shaw have found that by five years old, “children understand\nthat others have ideas and dislike the copying of these ideas”\n[2].\n"}, {"orig_sec": "Introduction", "label": "i", "text": "Yet, despite the fact that researchers in human computer interaction\nhave begun to explore the complexity of attribution and cited its\nimportance to remixing [1], many designers of\nonline communities pay little attention to issues of attribution\nin their designs – a fact that is reflected in user behavior. For\nexample, research on the use of photos from\nthe photo sharing site Flickr [2], as well as a number of\nother user-generated content communities\n[3], suggests that most re-users fail to\nattribute re-used content in ways that public-use licenses require.\nAlthough theory and survey based work points to a need to design for\nattribution in user-generated content communities, we still know very\nlittle about how attribution works or how designers might go about\ndoing so. Indeed, our study suggests that the most obvious efforts to\ndesign for attribution are likely to be ineffective.\n"}, {"orig_sec": "Introduction", "label": "i", "text": "In this paper, we employ a mixed methods approach that combines\nqualitative and quantitative analyses to explore users' reactions to\nattribution and its absence in a large remixing community. First, we\nintroduce our empirical setting; using qualitative data from users\nforums and comments, we present a rich description of remixing and\nevidence to support our core proposition that credit plays a central\nrole in remixing in our environment. Second, we contextualize and\ndescribe a technological intervention in our setting, responding\ndirectly to several user suggestions, that automated the attribution\nof creators of antecedent projects when content was remixed. Third, we\npresent a tentative quantitative analysis of the effect of this\nintervention along with a parallel analysis of the practice of manual\ncredit-giving. We find that credit-giving, done manually, is\nassociated with more positive reactions but that automatic attribution\nby the system is not associated with a similar effect. Fourth, we\npresent analysis of a set of in-depth interviews with twelve users\nwhich helps confirm, and add nuance and depth to, our quantitative\nfindings.\n"}, {"orig_sec": "Introduction", "label": "i", "text": "Our results suggest that young users see an important, if currently\nunder-appreciated and under-theorized, difference between\ncredit and attribution. Credit represents more than a\npublic reference to an “upstream” user's contributions. Coming from\nanother human, credit can involve an explicit acknowledgment, an\nexpression of gratitude, and an expression of deference, in a way that\nsimple attribution can not. Our results suggest that identical\nattribution information means something very different to users when\nit comes from a computer, and when it comes from a human – and that\nusers often feel that acknowledgment is worth much less when it comes\nfrom a system. We conclude that designers should create affordances\nthat make it easier for users to credit each other, rather than to\nmerely pursue automated means of acknowledgment.\n"}, {"orig_sec": "Introduction", "label": "i", "text": "Our study offers two distinct contributions for social scientists and\nfor technology designers. The first is an improved understanding of\nthe way that attribution and credit work in user-generated content\ncommunities. The second is a broader contribution to the literature on\ndesign that suggests an important limitation to technologists' ability to\nsupport community norms and a suggestion for how designers might\ncreate affordances. Functionality that allows users to\nexpress information that a system might otherwise show automatically\nmay play an important role in successful design for social media\nenvironments.\n"}, {"orig_sec": "Methodology", "label": "m", "text": "We conducted twelve one-hour semi-structured interviews with kids aged\n8 to 17 years old. All of the interviewees had\nexperience using\ncomputers and had access to the Internet at home. All the interviewees\nlive in the United States except for one who lives in New Zealand. The\nparticipants were recruited via the Scratch website and during\nmeet-ups with educators, teachers and young Scratch users. Eight of\nthe interviews were conducted in person, in the Boston area, and the\nrest over the phone or voice over IP. The interviews were\naudio-recorded and transcribed before fully analyzing them. Nine of\nthe interviewees were members of the Scratch community. The remaining\nthree did not use Scratch but were included as a way to check if\npeople who do not use Scratch have similar views about remixing,\nattribution, and credit. We found no substantive difference between\nthe Scratch users and non-users in their answers to questions related\nto the hypothetical automatic and manual mechanism for attribution.\n"}, {"orig_sec": "Methodology", "label": "m", "text": "Before each interview, subjects completed a survey that elicited\ndemographic information and posed questions about their familiarity\nwith other technologies and which was primarily designed to get a\nsense of the interviewees' social and technical background. Interviews\nwere structured around a protocol that included a set of nine\nfictional remixing cases intended to elicit conversations about\nremixing.Our interview protocol including example cases is\navailable at\nhttp://www.media.mit.edu/ andresmh/chi2011/interview.html. The\ncases were inspired by Sinnreich et al.'s theoretical work and from\nthree years of experience moderating the Scratch community. They were\ndesigned to present cases where remixing could be controversial but\nwhere there is no clear “correct” answer. The goal of the cases was\nto offer a concrete, and common, set of dilemmas to stimulate broad\nconversations about attitudes toward remixing.\n"}, {"orig_sec": "Methodology", "label": "m", "text": "The cases were presented in the form of printed screenshots of\ndifferent project pages from the Scratch website (anonymized to avoid\nreferring to real cases that users might have seen).\nThe print outs were shown to the interviewees (or\ndiscussed over the phone) while explaining each case. All the cases\nincluded a remix and its corresponding antecedent project. The cases varied\nin the presence of automatic attribution, manual credit, and\nthe degree of similarity between the remix and its antecedent. For example, the\nfirst three cases were:\n"}, {"orig_sec": "Methodology", "label": "m", "text": "\nA remix and its antecedent are identical. The project notes only\ndescribe how to play the video game. The remix shows the automatic\nattribution but no manual credit on the notes.\n\nA remix and its antecedent are different (as seen visually and\nin project metadata) but one can clearly see the influence of its\nantecedent project. The project notes of the remix show manual\ncredit but no automatic attribution. The interviewee was told to\nimagine the site had a glitch that prevented it from connecting it\nto its antecedent.\n\nThe same set of remix and antecedent projects as in (2) but this\ntime automatic attribution is displayed but manual credit is not.\n\n"}, {"orig_sec": "Methodology", "label": "m", "text": "Each of the interview logs was coded using\ninductive codes and grounded theory [1].\nThe coded responses were analyzed based on categories related to how\ninterviewees answered specific questions about the distinction between\nautomatic attribution and manual credit.\n"}, {"orig_sec": "Results", "label": "r", "text": "Confirming the results of Study 1, for users of Scratch, automatic\nattribution was generally seen as insincere and insufficient.\nThroughout the interviews, we found that for most of the kids, getting\nexplicit credit from another person was preferred over attribution\ngiven automatically by the system. When asked why, kids often\nresponded that knowing that another person had cared enough to give\ncredit was valued more than what the computer system would do on its\nown. The fact that it takes some work, albeit minimal, to write an\nacknowledgment statement, sends a signal of empathy, authenticity and\ngood intentions [1]. Amy articulated this when\nexplaining why she preferred getting credit from another person:\n"}, {"orig_sec": "Results", "label": "r", "text": "Similarly, Jon explained, “No [the “Based on” is not enough],\nbecause he [the remixer] didn't put that, it always says that.” For\nJon, automatic attribution is not authentic because it is always there\nand, as a result, it is clear that is not coming from the person doing\nthe remix.\n"}, {"orig_sec": "Results", "label": "r", "text": "Most of the interviewees seemed to have a clear notion of what they\nthink a moral remix should be. For some, it is all about making\nsomething different. Jake for example, defines a “good” remix as,\n“if it has a bunch of differences then it’s a good remix. If it has\nlike two, then it’s bad.” In addition to the differences between the\nremix and its antecedent project, for some, manual credit is part of\nwhat makes it moral. Charles said, “[remixing] is taking somebody\nelse's project and then changing a lot of it and sharing it and giving\ncredit.” Continuing, Charles explained:\n"}, {"orig_sec": "Results", "label": "r", "text": "If Green had actually said in the project notes, “This is a remix\nof Red's project, full credit goes to him,” then I would consider\nit a remix. But this [pointing at a remix without manual credit] is\ndefinitely a copy.\n"}, {"orig_sec": "Results", "label": "r", "text": "Interviewees suggested that manual credit also allows users to be more\nexpressive. For example, Susie explained that expressiveness is the\nreason that she prefers manual credit through the project notes\nsaying, “I think the manual one is better because you can say `thank\nyou' and things like that. The automatic one just says `it's based\non.”' Susie also notes that for her, the project notes are a space\nwhere a creator can express her wishes in regards to her intellectual\nproperty, independent, and even in contradiction to, the license of\nthe projects:\n"}, {"orig_sec": "Results", "label": "r", "text": "For Susie and other users of Scratch, the project notes are a space\nfor more than just instructions on how to interact with one's project;\nthey are an expressive space where one can communicate with an\naudience without having to encumber the creative piece of work with\nit.\n"}, {"orig_sec": "Results", "label": "r", "text": "Others point at the fact that people do not pay as much attention to\nautomatic attribution statement as much they do to the manual credit\nleft in project descriptions. Jake, for example, explains that, while\nhe agrees there is some usefulness to having both, project notes still\nare more important, “because, you know, sometimes people just like\nskim through a project and you don’t see it ‘til the end.” Jake\ncontinued to say that creators that do not have both should get a\n“warning.”\n"}, {"orig_sec": "Results", "label": "r", "text": "Even though interviewees value manual credit, they still see the\nusefulness of the automatic mechanism as some sort of\ncommunity-building prosthetic device – an explanation for the\npositive reactions to the feature's initial introduction. For example,\nNicole argues that while manual credit on the notes has more value for\nher, the automatic attribution is useful as a backup and because it\nprovides a link:\n"}, {"orig_sec": "Results", "label": "r", "text": "Well, I think that they should probably write in the notes that –\nthen it should also say “Based on blank's project,” just in case\nthey forget, and also because it gives a link to the original\nproject and it gives a link to the user so you don't have to search\nfor it.\n"}, {"orig_sec": "Results", "label": "r", "text": "A similar explanation was articulated on a comment exchange on one the\nwebsite's galleries. A teenage girl that actively participates in\nScratch explained the pragmatic value of automatic attribution saying,\n“the `based on' thingy, it gives a link, and we all luv links, less\ntyping,” before reiterating that manual credit is more valuable:\n"}, {"orig_sec": "Results", "label": "r", "text": "at the beginning i thought that you don't have to give credit when\nthe “based on” thingy is in there, but i realized a lot of people\ndon't look at that, and i noticed people confused the remix with the\noriginal.\n"}, {"orig_sec": "Results", "label": "r", "text": "Creating a Scratch project is a complicated task. A project's sources\ncan be diverse and the creator can easily forget to acknowledge some,\nas Paul explains, when asked to choose between a system of manual\ncredit or automatic attribution:\n"}, {"orig_sec": "Results", "label": "r", "text": "There are also situations where interviewees recognize what Posner\ncalls the “awkwardness of acknowledgment,” that is, situations where\ncredit is not really needed and it can be an unnecessary burden or go\nagainst the aesthetics of the work [1]. For\nexample, Paul mentioned that sometimes, there are some projects in\nScratch that are remixed so much – like the sample projects that come\nwith Scratch or some “remix chains”Remix chains typically\nstart with someone sharing a project inviting others to remix\n(i.e. “add your animated avatar to the park.”) – where credit is not\nnecessary:\n"}, {"orig_sec": "Results", "label": "r", "text": "There's this one called “perfect platformer base” which a lot of\npeople remix. So I don't think that needs any credit. It's not\nactually a real game. It's all the levels and stuff are just\ndemonstrations.\n"}, {"orig_sec": "Results", "label": "r", "text": "Since manual crediting has a higher emotional value, some kids\nmentioned that conflicts over remixing could be addressed by the\nadministrators of the site by editing the project of the remix in\nquestion, as a way to enforce credit without transforming it into\nattribution. Doing so would make it appear that a remixer had credited\nan antecedent when they had not. Susie offers a suggestion along these\nlines when asked about how the administrators of the website should\ndeal with a case of a complaint over a remix that is a parody of\nsomeone else's project. Susie suggested that, “I might remove the\nproject but I might not, you know, maybe I would edit the notes to to\ngive credit.” Similarly, Charles described his approach for solving\nconflicts if he was the administrator of the website suggesting that,\n“I probably just would stay out of the argument. I probably wouldn't\nremove it [the remix], I'd just add something in the project notes\n[like] `based on Gray's project.”'\n"}, {"orig_sec": "Results", "label": "r", "text": "This phenomena of giving less value to technologically simplified\nsocial signals is experienced in other social platforms. For example,\nAmy expressed how on the social network site Facebook, she loves to\nget comments on her photographs but dislikes those who do not leave\ncomments or opt instead to press the “I like it” button:\n"}, {"orig_sec": "Results", "label": "r", "text": "I love when people comment on my pictures. Everybody sees them,\nbecause they tell me they have. I'm like, “Oh really? That's\ngreat. Why didn't you comment?” I don't like it when people just\n“like it”, because you know they have something to say about it;\nthey just don't. It's like, if they like it, then [they should]\ntake the time to say something.\n"}, {"orig_sec": "Results", "label": "r", "text": "Although not designed to be a random sample, these interviews support\nthe proposition that both Scratch participants and other young people\nshare a set of norms about characteristics that determine what a\n“good” or moral remix is. Among these norms, acknowledging one's\nsources seems to play a central role. However, participants also seem\nto share the opinion that this norm is not satisfied through an\nautomated process. They clearly understand the pragmatic value of\nautomating acknowledgment-giving, but\nthey do not see it as a substitute for adherence to the social norm of\ncredit-giving. They also see it as void of emotion and expressiveness.\nFor Scratch users, normative constraints are separate from\narchitectural constraints and one cannot replace the other.\nThese findings support and enrich the results from our first\nstudy and help us understand better how Scratch participants, and\nperhaps kids in general, experience authorship norms and automation in\nonline spaces.\n"}, {"orig_sec": "Conclusions", "label": "d", "text": "Our results from Study 1a called into the question the effectiveness\nof automatic attribution functionality in encouraging more positive\nuser reactions in Scratch. We build on these results in Study 1b to\nsuggest that manual crediting may do the work that Scratch's designers\nhad hoped automatic attribution would. Results from the analysis of\nuser interviews presented in Study 2 help to answer the question of\n“why?” and suggest that users find manual credit to be more\nauthentic and more meaningful to users because it takes more time and\neffort. Usually, UI improvements are designed to help reduce the time\nand effort involved in using a system. But in trying to help users by attributing automatically,\nScratch's designers misunderstood the way that attribution as a social\nmechanism worked for Scratch's users. Our fundamental insight is that\nwhile both attribution and credit may be important, they are distinct\nconcepts and that credit is, socially, worth more. A system can\nattribute the work of a user but credit, which is seen\nas much more important by users and which has a greater effect on user\nbehavior, cannot be done automatically. Computers can\nattribute. Crediting, however, takes a human.\n"}, {"orig_sec": "Conclusions", "label": "d", "text": "As we suggested in our introduction, this fundamental result leads to\ntwo distinct contributions. First, and more specifically, our analysis\noffers an improved understanding of the way that attribution and\ncredit works in user-generated content communities over what has been\navailable in previous work. Our two studies suggest that scholars are\ncorrect to argue that credit plays an important role in social media\ncommunities and offer empirical confirmation for the important role\nthat authenticity plays in how users conceptualize credit. In our\nin-depth interviews, we explain some of the reasons why this may be\nthe case. Second, through our evaluation of an unsuccessful\ntechnological design, our work offers a broader, if more preliminary,\ncontribution in suggesting an important limit of designers' ability to\nsupport community norms in social media systems. As the literature on\ndesign and social media grows, the importance of good support for\ncommunities with healthy norms promoting positive interactions is\nlikely to increase. In attempting to design for these norms, we\nsuspect that researchers will increasingly encounter similar\nchallenges.\n"}, {"orig_sec": "Conclusions", "label": "d", "text": "We argue that designers should approach interventions iteratively.\nThis design approach can be understood through the\ntheoretical lens of the social construction of technology\n[1]: designers can't control technological outcomes which\nmust be built through a close relationship between designers and users.\nDesigners must move away from seeing their profession as\nproviding solutions. They must channel users, work closely with them,\nand iterate together, to negotiate and achieve a set of shared goals.\n"}, {"orig_sec": "Conclusions", "label": "d", "text": "The prevalence of user-generated content sites stresses the importance\nof how online social spaces should deal with issues of attribution and\nour results are likely to be immediately relevant to\ndesigners. For example, the Semantic Clipboard is a tool built as a\nsystem of automatic attribution for content reuse\n[1]. Developed by researchers who\nfound a high degree of Creative Commons license violations around the\nre-use of Flickr images, the tool is a Firefox plugin that provides,\n“license awareness of Web media,” and enables people to\nautomatically, “copy [media] along with the appropriate license\nmetadata.” Our results suggest one way that this approach\nmay fall short.\n"}, {"orig_sec": "Conclusions", "label": "d", "text": "However, automatic attribution is not the only way that technologists\ncan design to acknowledge others' contributions. Indeed, our results\nsuggest that there may be gains from design changes which encourage\ncredit-giving without simply automating attribution. For example,\nScratch's designers might present users with a metadata field that\nprompts users to credit others and suggests antecedent authors whose\nwork the system has determined may have played a role. This affordance\nmight remind users to credit others, and might increase the amount of\ncrediting, while maintaining a human role in the process and the extra\neffort that, our research has suggested, imbues manual credit giving\nwith its value. We suggest that in other social media communities,\nsimilar affordances that help prompt or remind users to do things that\na system might do automatically represent a class of increasingly\nimportant design patterns and a template for successful design\ninterventions in support of community norms.\n"}]}